#include <stdio.h>
#include <math.h>
#include <locale.h>
void main()
{
	//средние плотности: 700 - ДВП
	char* locale = setlocale(LC_ALL, "");
	double h, d, w,m1,m2,m3,m4,m5;
	printf("Введите след.параметры (высота, глубина, ширина) в см: ");
	scanf_s("%lf %lf %lf", &h, &d, &w);
	if ((180.0<=h)&&(h<=220.0)&&(80.0<=w)&&(w<=120.0)&&(50.0<=d)&&(d<=90))
	{
		m1 = (h * w * 0.5 * 0.000001 * 700);
		m2 = ((h * d * 1.5 * 0.000001 * 750) * 2);
		m3 = ((w * d * 1.5 * 0.000001 * 750) * 2);
		m4 = ((h * w * 0.000001 * 650) * 2);
		m5 = (w * d * 0.000001 * 750 * round((h - 3) / 40.0));

		printf("Масса шкафа в кг: %lf", m1+m2+m3+m4+m5);
	}
	else
	{
		printf("Неверные_Данные");
	}
}