#include <stdio.h>
#include <math.h>
#include <locale.h>
void main()
{
	//средние плотности: 700 - ДВП
	char* locale = setlocale(LC_ALL, "");
	double h, d, w, v;
	printf("Введите след.параметры (высота, глубина, ширина) в см: ");
	scanf_s("%lf %lf %lf", &h, &d, &w);
	if ((180.0<=h)&&(h<=220.0)&&(80.0<=w)&&(w<=120.0)&&(50.0<=d)&&(d<=90))
	{
		v = (h * w * 0.5 * 0.000001 * 700) + ((h * d * 1.5 * 0.000001 * 750) * 2) + ((w * d * 1.5 * 0.000001 * 750) * 2) + ((h * w * 0.000001 * 650) * 2) + (w * d * 0.000001 * 750 * round((h - 3) / 40.0));

		printf("Масса шкафа в кг: %lf", v);
	}
	else
	{
		printf("Неверные_Данные");
	}
}